<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"cf9ef654a5b2eca44ff31e1ffce5c841f88a4770e2ab57223de41363e28f1deb","plan_job_ref":"Job Run Terraform plan in staging #261 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14933601199","plan_out_hash":"1592b2e94351aaefa1cf1d0d2b1aa2d8751a949a67e3e390ed1007bc1c410366","plan_hash":"9c0f8a3162b3a38c44fc03c23ae8bf15a40c2ecb9d481830064ea8a6e944cd39","plan_text_format":"diff","version":"1.48.0","closed":true} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app_route[0].cloudfoundry_route.app_route must be replaced
-/+ resource "cloudfoundry_route" "app_route" {
!~      created_at   = "2025-05-05T21:46:17Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> null
-               app_process_type = "web" -> null
-               id               = "af32b47f-3068-43a9-b31a-498745b66b7f" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      host         = "continuous_monitoring-staging" -> "continuous-monitoring-staging" # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      updated_at   = "2025-05-05T21:46:17Z" -> (known after apply)
!~      url          = "continuous_monitoring-staging.app.cloud.gov" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Deploy Staging #112](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14933637561)